config.org
#+TITLE: config
#+PROPERTY: header-args :results silent
* Setups

#+BEGIN_SRC sh :tangle no
brew install wordnet
brew install languagetool
brew install aspell
brew install terminal-notifier
#+END_SRC
* User Config
** Global settings
Enable emacs mode depending on the file format
#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.avsc\\'" . json-mode))
  (add-to-list 'auto-mode-alist '("\\.lock\\'" . toml-mode))
  (add-to-list 'auto-mode-alist '("\\.csv\\'" . org-mode))
  (add-to-list 'auto-mode-alist '("\\.zsh\\'" . sh-mode))
#+END_SRC
doom theme and mode settings
#+BEGIN_SRC emacs-lisp
(after! doom-modeline
  (setq doom-modeline-major-mode-icon t)
  (setq doom-modeline-buffer-encoding nil)
  (setq doom-modeline-persp-name t)
  (setq vc-handled-backends nil)
  (setq inhibit-compacting-font-caches t)
  (setq doom-modeline-mu4e t))
(setq doom-theme 'doom-one-light)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq exec-path-from-shell-check-startup-files nil)
#+END_SRC
** Git
Set =giteditor= as emacs using =witheditor=
#+BEGIN_SRC emacs-lisp
  (define-key (current-global-map)
    [remap async-shell-command] 'with-editor-async-shell-command)
  (define-key (current-global-map)
    [remap shell-command] 'with-editor-shell-command)
  (add-hook 'eshell-mode-hook 'with-editor-export-editor)
  (add-hook 'term-exec-hook   'with-editor-export-editor)
#+END_SRC

Show branch name before tags
#+BEGIN_SRC emacs-lisp
 (setq magit-log-show-refname-after-summary t)
#+END_SRC

Keybindings
#+BEGIN_SRC emacs-lisp
(map! :map with-editor-mode-map
      :after magit
      :localleader
      "," #'with-editor-finish
      "c" #'with-editor-finish
      "k" #'with-editor-cancel)
(after! magit-todos
  (setq magit-todos-update nil))
#+END_SRC

#+begin_src emacs-lisp
;; refactor this
(defun ediff-copy-both-to-C ()
  (interactive)
  (ediff-copy-diff ediff-current-difference nil 'C nil
                   (concat
                    (ediff-get-region-contents ediff-current-difference 'A ediff-control-buffer)
                    (ediff-get-region-contents ediff-current-difference 'B ediff-control-buffer))))
(defun add-d-to-ediff-mode-map () (define-key ediff-mode-map "B" 'ediff-copy-both-to-C))
(add-hook 'ediff-keymap-setup-hook 'add-d-to-ediff-mode-map)
#+end_src

#+BEGIN_SRC emacs-lisp
(setq kill-do-not-save-duplicates t)
#+END_SRC
** Global Keybindings
#+BEGIN_SRC emacs-lisp
(after! evil-snipe (evil-snipe-mode -1))
(map! :n "s" #'save-buffer)
(setq doom-localleader-key ",")
(map! :after evil
      :vin "C-y" #'counsel-yank-pop)
#+END_SRC
#+BEGIN_SRC emacs-lisp
(map!
 :v "s" #'evil-surround-region

 (:when (featurep! :editor fold)
   :nv "zz" #'+fold/toggle))
#+END_SRC
#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix-map ("f" . "file")
        :desc "Delete this file"            "D"   #'doom/delete-this-file)

      (:prefix-map ("g" . "git")
        (:when (featurep! :tools magit)
          :desc "Magit dispatch"            "m"   #'magit-dispatch
          :desc "Forge dispatch"            "'"   #'forge-dispatch
          :desc "Magit status"              "s"   #'magit-status
          :desc "Magit blame"               "b"   #'magit-blame-addition))
      )
#+END_SRC

Ivy resume
#+BEGIN_SRC emacs-lisp
 (map! :leader
      "r" #'ivy-resume
      )
#+END_SRC

Avy timer
#+BEGIN_SRC emacs-lisp
(map! "C-s" 'evil-avy-goto-char-timer
      "C-l" 'evil-avy-goto-line)
(after! avy
  (setq avy-all-windows t))

#+END_SRC

** Searching
#+BEGIN_SRC emacs-lisp
(map! :leader "ss" #'swiper)
#+END_SRC


Open links
#+BEGIN_SRC emacs-lisp
(map! :leader
      "x" nil)
(def-package! link-hint
  :defer t
  :init
  (map! :leader
        :prefix ("x")
        "o" 'link-hint-open-link
        "O" 'link-hint-open-multiple-links
        "y" 'link-hint-copy-link))
#+END_SRC

** Window Movement

#+BEGIN_SRC emacs-lisp
(map! :leader
      "ww" #'ace-window
      "wd" #'evil-quit
      "wD" #'ace-delete-window
      )
#+END_SRC

#+BEGIN_SRC emacs-lisp
(after! ace-window
:pre-config
 (set-face-attribute
  'aw-leading-char-face nil
  :foreground "deep sky blue"
  :weight 'bold
  :height 3.0)
 (set-face-attribute
  'aw-mode-line-face nil
  :inherit 'mode-line-buffer-id
  :foreground "lawn green")
 (setq aw-keys '(?a ?s ?d ?f ?j ?k ?l)
       aw-dispatch-always t
       aw-dispatch-alist
       '((?d aw-delete-window "Ace - Delete Window")
         (?c aw-swap-window "Ace - Swap Window")
         (?n aw-flip-window)
         (?v aw-split-window-vert "Ace - Split Vert Window")
         (?h aw-split-window-horz "Ace - Split Horz Window")
         (?m delete-other-windows "Ace - Maximize Window")
         (?g delete-other-windows)
         (?b balance-windows)
         (?u (lambda ()
               (progn
                 (winner-undo)
                 (setq this-command 'winner-undo))))
         (?r winner-redo)))
 (ace-window-display-mode t))
#+END_SRC
** Project Management
#+BEGIN_SRC emacs-lisp
(after! projectile
  :post-config
  (add-to-list 'projectile-globally-ignored-directories "vendor")
  (add-to-list 'projectile-globally-ignored-directories ".gen")
  (add-to-list 'projectile-globally-ignored-directories "go-build")
  (setq projectile-sort-order 'recentf)
  )

#+END_SRC

#+BEGIN_SRC emacs-lisp
;; rebuild cache on project checkout
(defun run-projectile-invalidate-cache (&rest _args)
  ;; We ignore the args to `magit-checkout'.
  (projectile-invalidate-cache nil))
(advice-add 'magit-checkout
            :after #'run-projectile-invalidate-cache)
(advice-add 'magit-branch-and-checkout ; This is `b c'.
            :after #'run-projectile-invalidate-cache)
#+END_SRC

Remap workspaces to ~l~
#+BEGIN_SRC emacs-lisp


(map! :leader
      :after ivy
      (:when (featurep! :ui workspaces)
        (:prefix-map ("l" . "workspace")
          :desc "Display tab bar"           "d" #'+workspace/display
          :desc "Switch workspace"          "l"   #'+workspace/switch-to
          :desc "New workspace"             "c"   #'+workspace/new
          :desc "Load workspace from file"  "L"   #'+workspace/load
          :desc "Save workspace to file"    "s"   #'+workspace/save
          :desc "Delete session"            "x"   #'+workspace/kill-session
          :desc "Delete this workspace"     "d"   #'+workspace/delete
          :desc "Rename workspace"          "r"   #'+workspace/rename
          :desc "Restore last session"      "R"   #'+workspace/restore-last-session
          :desc "Next workspace"            "n"   #'+workspace/switch-right
          :desc "Previous workspace"        "p"   #'+workspace/switch-left
          :desc "Switch to 1st workspace"   "1"   (λ! (+workspace/switch-to 0))
          :desc "Switch to 2nd workspace"   "2"   (λ! (+workspace/switch-to 1))
          :desc "Switch to 3rd workspace"   "3"   (λ! (+workspace/switch-to 2))
          :desc "Switch to 4th workspace"   "4"   (λ! (+workspace/switch-to 3))
          :desc "Switch to 5th workspace"   "5"   (λ! (+workspace/switch-to 4))
          :desc "Switch to 6th workspace"   "6"   (λ! (+workspace/switch-to 5))
          :desc "Switch to 7th workspace"   "7"   (λ! (+workspace/switch-to 6))
          :desc "Switch to 8th workspace"   "8"   (λ! (+workspace/switch-to 7))
          (:prefix-map ("v" . "views")
           :desc "switch view" "v" #'ivy-switch-view
           :desc "push view" "a" #'ivy-push-view
           :desc "pop view" "x" #'ivy-pop-view)
          :desc "Switch to 9th workspace"   "9"   (λ! (+workspace/switch-to 8))
          :desc "Switch to last workspace"  "0"   #'+workspace/switch-to-last)))

(map! :leader
      :desc "Search project"                "/" #'+default/search-project
      ;;; <leader> p --- project
      (:prefix-map ("p" . "project")
        :desc "Browse project"               "p" #'+default/browse-project
        :desc "Find file in project"  "f"  #'projectile-find-file
        :desc "Switch project"               "l" #'projectile-switch-project
        :desc "Pop up scratch buffer"        "S" #'doom/open-project-scratch-buffer)
      )
#+END_SRC
** Buffers
#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix-map ("b" . "buffer")
        :desc "Pop up scratch buffer"       "d"   #'kill-current-buffer
        :desc "Pop up scratch buffer"       "s"   #'doom/open-scratch-buffer)
      "TAB" #'previous-buffer
      )

#+END_SRC
