config.el
  (add-to-list 'auto-mode-alist '("\\.avsc\\'" . json-mode))
  (add-to-list 'auto-mode-alist '("\\.lock\\'" . toml-mode))
  (add-to-list 'auto-mode-alist '("\\.csv\\'" . org-mode))
  (add-to-list 'auto-mode-alist '("\\.zsh\\'" . sh-mode))

(setq doom-theme 'doom-one-light)

  (define-key (current-global-map)
    [remap async-shell-command] 'with-editor-async-shell-command)
  (define-key (current-global-map)
    [remap shell-command] 'with-editor-shell-command)
  (add-hook 'eshell-mode-hook 'with-editor-export-editor)
  (add-hook 'term-exec-hook   'with-editor-export-editor)

 (setq magit-log-show-refname-after-summary t)

(map! :map with-editor-mode-map
      :after magit
      :localleader
      "," #'with-editor-finish
      "c" #'with-editor-finish
      "k" #'with-editor-cancel)

(defun ediff-copy-both-to-C ()
  (interactive)
  (ediff-copy-diff ediff-current-difference nil 'C nil
                   (concat
                    (ediff-get-region-contents ediff-current-difference 'A ediff-control-buffer)
                    (ediff-get-region-contents ediff-current-difference 'B ediff-control-buffer))))
(add-hook 'ediff-keymap-setup-hook 'add-d-to-ediff-mode-map)
(map! :map ediff-mode-map
      :n "B" 'ediff-copy-both-to-C)

(after! evil-snipe (evil-snipe-mode -1))
(map! :n "s" #'save-buffer)
(setq doom-localleader-key ",")

(map!
 :v "s" #'evil-surround-region

 (:when (featurep! :editor fold)
   :nv "zz" #'+fold/toggle))

(map! :leader
      (:prefix-map ("f" . "file")
        :desc "Delete this file"            "D"   #'doom/delete-this-file)

      (:prefix-map ("g" . "git")
        (:when (featurep! :tools magit)
          :desc "Magit dispatch"            "m"   #'magit-dispatch
          :desc "Forge dispatch"            "'"   #'forge-dispatch
          :desc "Magit status"              "s"   #'magit-status
          :desc "Magit blame"               "b"   #'magit-blame-addition))
      )

 (map! :leader
      "r" #'ivy-resume
      )

(map! "C-s" 'evil-avy-goto-char-timer
      "C-l" 'evil-avy-goto-line)
(after! avy
  (setq avy-all-windows t))

(map! :leader "ss" #'swiper)

(map! :leader
      "ww" #'ace-window
      "wd" #'evil-quit
      "wD" #'ace-delete-window
      )

(after! ace-window
:pre-config
 (set-face-attribute
  'aw-leading-char-face nil
  :foreground "deep sky blue"
  :weight 'bold
  :height 3.0)
 (set-face-attribute
  'aw-mode-line-face nil
  :inherit 'mode-line-buffer-id
  :foreground "lawn green")
 (setq aw-keys '(?a ?s ?d ?f ?j ?k ?l)
       aw-dispatch-always t
       aw-dispatch-alist
       '((?d aw-delete-window "Ace - Delete Window")
         (?c aw-swap-window "Ace - Swap Window")
         (?n aw-flip-window)
         (?v aw-split-window-vert "Ace - Split Vert Window")
         (?h aw-split-window-horz "Ace - Split Horz Window")
         (?m delete-other-windows "Ace - Maximize Window")
         (?g delete-other-windows)
         (?b balance-windows)
         (?u (lambda ()
               (progn
                 (winner-undo)
                 (setq this-command 'winner-undo))))
         (?r winner-redo)))
 (ace-window-display-mode t))

(after! projectile
  :post-config
  (add-to-list 'projectile-globally-ignored-directories "vendor")
  (add-to-list 'projectile-globally-ignored-directories ".gen")
  (add-to-list 'projectile-globally-ignored-directories "go-build")
  (setq projectile-sort-order 'recentf)
  )

(map! :leader
      (:when (featurep! :ui workspaces)
        (:prefix-map ("l" . "workspace")
          :desc "Display tab bar"           "d" #'+workspace/display
          :desc "Switch workspace"          "l"   #'+workspace/switch-to
          :desc "New workspace"             "n"   #'+workspace/new
          :desc "Load workspace from file"  "L"   #'+workspace/load
          :desc "Save workspace to file"    "s"   #'+workspace/save
          :desc "Delete session"            "x"   #'+workspace/kill-session
          :desc "Delete this workspace"     "d"   #'+workspace/delete
          :desc "Rename workspace"          "r"   #'+workspace/rename
          :desc "Restore last session"      "R"   #'+workspace/restore-last-session
          :desc "Next workspace"            "]"   #'+workspace/switch-right
          :desc "Previous workspace"        "["   #'+workspace/switch-left
          :desc "Switch to 1st workspace"   "1"   (λ! (+workspace/switch-to 0))
          :desc "Switch to 2nd workspace"   "2"   (λ! (+workspace/switch-to 1))
          :desc "Switch to 3rd workspace"   "3"   (λ! (+workspace/switch-to 2))
          :desc "Switch to 4th workspace"   "4"   (λ! (+workspace/switch-to 3))
          :desc "Switch to 5th workspace"   "5"   (λ! (+workspace/switch-to 4))
          :desc "Switch to 6th workspace"   "6"   (λ! (+workspace/switch-to 5))
          :desc "Switch to 7th workspace"   "7"   (λ! (+workspace/switch-to 6))
          :desc "Switch to 8th workspace"   "8"   (λ! (+workspace/switch-to 7))
          :desc "Switch to 9th workspace"   "9"   (λ! (+workspace/switch-to 8))
          :desc "Switch to last workspace"  "0"   #'+workspace/switch-to-last)))

(map! :leader
      ;;; <leader> p --- project
      (:prefix-map ("p" . "project")
        :desc "Browse project"               "p" #'+default/browse-project
        :desc "Find file in project"  "f"  #'projectile-find-file
        :desc "Switch project"               "l" #'projectile-switch-project
        :desc "Pop up scratch buffer"        "S" #'doom/open-project-scratch-buffer
        :desc "Search project"                "/" #'+default/search-project)
      )

(map! :leader
      (:prefix-map ("b" . "buffer")
        :desc "Pop up scratch buffer"       "d"   #'kill-current-buffer
        :desc "Pop up scratch buffer"       "s"   #'doom/open-scratch-buffer)
      "TAB" #'previous-buffer
      )

(map! :leader
      ;;; <leader> / --- search
