config.org
** Searching
#+BEGIN_SRC emacs-lisp
(map! :leader
      ;;; <leader> / --- search
      (:prefix-map ("s" . "search")
        :desc "Search buffer"                 "s" #'swiper
        :desc "Search current directory"      "d" #'+default/search-from-cwd
        :desc "Jump to symbol"                "i" #'imenu
        :desc "Jump to link"                  "l" #'ace-link
        :desc "Look up online"                "o" #'+lookup/online-select
        :desc "Look up in local docsets"      "k" #'+lookup/in-docsets
        :desc "Look up in all docsets"        "K" #'+lookup/in-all-docsets
        :desc "Search project"                "p" #'+default/search-project)

      ;;; <leader> s --- snippets
      (:when (featurep! :editor snippets)
        (:prefix-map ("S" . "snippets")
          :desc "New snippet"                "n" #'yas-new-snippet
          :desc "Insert snippet"             "i" #'yas-insert-snippet
          :desc "Jump to mode snippet"       "/" #'yas-visit-snippet-file
          :desc "Jump to snippet"            "s" #'+snippets/find-file
          :desc "Browse snippets"            "S" #'+snippets/browse
          :desc "Reload snippets"            "r" #'yas-reload-all
          :desc "Create temporary snippet"   "c" #'aya-create
          :desc "Use temporary snippet"      "e" #'aya-expand)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(set-docsets! 'go-mode "go")
#+END_SRC
** Tools
TLDR for documentation
#+BEGIN_SRC emacs-lisp
(def-package! tldr
:commands tldr
:defer t)
#+END_SRC

Exit async buffer on ~q~
#+BEGIN_SRC emacs-lisp
 (defun arnav/maybe-set-quit-key ()
   (when (string= (buffer-name) "*Async Shell Command*")
     (local-set-key (kbd "q") #'quit-window)))

 (add-hook 'shell-mode-hook #'arnav/maybe-set-quit-key)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(def-package! alert
:defer t
:config
  (setq alert-default-style 'osx-notifier)
)
#+END_SRC

Ivy/Swiper/Counsel
#+BEGIN_SRC emacs-lisp
(map!
 :map ivy-minibuffer-map "C-c o" #'ivy-occur)
#+END_SRC
** Latex
#+BEGIN_SRC emacs-lisp
(setq +latex-viewers '(pdf-tools))
#+END_SRC

#+begin_src  emacs-lisp
(after! ivy-bibtex
  :pre-config
  (setq bibtex-completion-bibliography "~/Papers/references.bib"
        bibtex-completion-library-path '("~/Papers/pdfs/")
        bibtex-completion-notes-path "~/Papers/notes/")
  )

#+end_src
*** PDF Tools config
#+BEGIN_SRC emacs-lisp
(after! (hydra pdf-tools)
 (defhydra hydra-pdftools (:color blue :hint nil)
   "
                                                                      ╭───────────┐
       Move  History   Scale/Fit     Annotations  Search/Link    Do   │ PDF Tools │
   ╭──────────────────────────────────────────────────────────────────┴───────────╯
         ^^_g_^^      _B_    ^↧^    _+_    ^ ^     [_al_] list    [_s_] search    [_u_] revert buffer
         ^^^↑^^^      ^↑^    _H_    ^↑^  ↦ _W_ ↤   [_am_] markup  [_o_] outline   [_i_] info
         ^^_p_^^      ^ ^    ^↥^    _0_    ^ ^     [_at_] text    [_F_] link      [_d_] dark mode
         ^^^↑^^^      ^↓^  ╭─^─^─┐  ^↓^  ╭─^ ^─┐   [_ad_] delete  [_f_] search link
    _h_ ←pag_e_→ _l_  _N_  │ _P_ │  _-_    _b_     [_aa_] dired
         ^^^↓^^^      ^ ^  ╰─^─^─╯  ^ ^  ╰─^ ^─╯   [_y_]  yank
         ^^_n_^^      ^ ^  _r_eset slice box
         ^^^↓^^^
         ^^_G_^^
   --------------------------------------------------------------------------------
        "
   ("." hydra-master/body "back")
   ("<ESC>" nil "quit")
   ("al" pdf-annot-list-annotations)
   ("ad" pdf-annot-delete)
   ("aa" pdf-annot-attachment-dired)
   ("am" pdf-annot-add-markup-annotation)
   ("at" pdf-annot-add-text-annotation)
   ("y"  pdf-view-kill-ring-save)
   ("+" pdf-view-enlarge :color red)
   ("-" pdf-view-shrink :color red)
   ("0" pdf-view-scale-reset)
   ("H" pdf-view-fit-height-to-window)
   ("W" pdf-view-fit-width-to-window)
   ("P" pdf-view-fit-page-to-window)
   ("n" pdf-view-next-page-command :color red)
   ("p" pdf-view-previous-page-command :color red)
   ("d" pdf-view-dark-minor-mode)
   ("b" pdf-view-set-slice-from-bounding-box)
   ("r" pdf-view-reset-slice)
   ("g" pdf-view-first-page)
   ("G" pdf-view-last-page)
   ("e" pdf-view-goto-page)
   ("o" pdf-outline)
   ("s" pdf-occur)
   ("i" pdf-misc-display-metadata)
   ("u" pdf-view-revert-buffer)
   ("F" pdf-links-action-perfom)
   ("f" pdf-links-isearch-link)
   ("B" pdf-history-backward :color red)
   ("N" pdf-history-forward :color red)
   ("l" image-forward-hscroll :color red)
   ("h" image-backward-hscroll :color red))

 )
#+END_SRC
#+BEGIN_SRC emacs-lisp
(after! pdf-tools
  (setq-default pdf-view-display-size 'fit-page)
  (map! :map pdf-view-mode-map
        :localleader
        "." #'hydra-pdftools/body
        "<s-spc>"   #'pdf-view-scroll-down-or-next-page
        "g"   #'pdf-view-first-page
        "G"   #'pdf-view-last-page
        "l"   #'image-forward-hscroll
        "h"   #'image-backward-hscroll
        "j"   #'pdf-view-next-page
        "k"   #'pdf-view-previous-page
        "e"   #'pdf-view-goto-page
        "u"   #'pdf-view-revert-buffer
        "al"  #'pdf-annot-list-annotations
        "ad"  #'pdf-annot-delete
        "aa"  #'pdf-annot-attachment-dired
        "am"  #'pdf-annot-add-markup-annotation
        "at"  #'pdf-annot-add-text-annotation
        "y"   #'pdf-view-kill-ring-save
        "i"   #'pdf-misc-display-metadata
        "s"   #'pdf-occur
        "b"   #'pdf-view-set-slice-from-bounding-box
        "r"   #'pdf-view-reset-slice))
#+END_SRC

** Eshell
#+BEGIN_SRC emacs-lisp
  (setq eshell-aliases-file "/Users/arnav/dotfiles/eshell-aliases")
#+END_SRC


Aweshell
#+BEGIN_SRC emacs-lisp
(def-package! aweshell
  :config
  (map! :leader
        (:prefix ("e" . "awesomesll")
          "c" #'aweshell-new
          "a" #'aweshell-switch-buffer
          "n" #'aweshell-next
          "p" #'aweshell-prev
          "S" #'aweshell-sudo-toggle
          )
        "'" #'+eshell/split-below
        )

  )
#+END_SRC
** Private

#+begin_src emacs-lisp
(defun arnav/ussh ()
  (interactive)
  (async-shell-command "ussh"))

(defun arnav/insert-pass ()
  (interactive)
  (insert "IWork@Ub3rFin3ng"))

(map! :leader
      "C-u" #'arnav/ussh)

(map! :map minibuffer-local-map
      "M-u" #'arnav/insert-pass)
#+end_src
** Completions/LSP
#+BEGIN_SRC emacs-lisp
(after! lsp
  (setq lsp-ui-sideline-show-symbol nil)
  (setq lsp-ui-sideline-delay 15)
  (setq company-lsp-cache-candidates 'auto))
#+END_SRC
