config.el
      (:prefix-map ("s" . "search")
        :desc "Search buffer"                 "s" #'swiper
        :desc "Search current directory"      "d" #'+default/search-from-cwd
        :desc "Jump to symbol"                "i" #'imenu
        :desc "Jump to link"                  "l" #'ace-link
        :desc "Look up online"                "o" #'+lookup/online-select
        :desc "Look up in local docsets"      "k" #'+lookup/in-docsets
        :desc "Look up in all docsets"        "K" #'+lookup/in-all-docsets
        :desc "Search project"                "p" #'+default/search-project)

      ;;; <leader> s --- snippets
      (:when (featurep! :editor snippets)
        (:prefix-map ("/" . "snippets")
          :desc "New snippet"                "n" #'yas-new-snippet
          :desc "Insert snippet"             "i" #'yas-insert-snippet
          :desc "Jump to mode snippet"       "/" #'yas-visit-snippet-file
          :desc "Jump to snippet"            "s" #'+snippets/find-file
          :desc "Browse snippets"            "S" #'+snippets/browse
          :desc "Reload snippets"            "r" #'yas-reload-all
          :desc "Create temporary snippet"   "c" #'aya-create
          :desc "Use temporary snippet"      "e" #'aya-expand)))

(set-docsets! 'go-mode "go")

(def-package! tldr
:commands tldr
:defer t)

 (defun arnav/maybe-set-quit-key ()
   (when (string= (buffer-name) "*Async Shell Command*")
     (local-set-key (kbd "q") #'quit-window)))

 (add-hook 'shell-mode-hook #'arnav/maybe-set-quit-key)

(def-package! alert
:defer t
:config
  (setq alert-default-style 'osx-notifier)
)

(map!
 :map ivy-minibuffer-map "C-c o" #'ivy-occur)

(setq +latex-viewers '(pdf-tools))

(after! ivy-bibtex
  :pre-config
  (setq bibtex-completion-bibliography "~/Papers/references.bib"
        bibtex-completion-library-path '("~/Papers/pdfs/")
        bibtex-completion-notes-path "~/Papers/notes/")
  )

  (setq eshell-aliases-file "/Users/arnav/dotfiles/eshell-aliases")

(def-package! aweshell
  :commands aweshell-new
  :defer
  :after eshell
  :config
  (map! :leader
        (:prefix ("a" . "awesomesll")
          "c" #'aweshell-new
          "a" #'aweshell-switch-buffer
          "n" #'aweshell-next
          "p" #'aweshell-prev
          "S" #'aweshell-sudo-toggle
          )
        )

  )


(after! lsp
  (setq lsp-ui-sideline-show-symbol nil)
  (setq lsp-ui-sideline-delay 15)
  (setq company-lsp-cache-candidates 'auto))

(map! :leader
      "X" nil)
(map! :leader
      :desc "Open mu4e" "X" #'mu4e)
