config.org
** Email

#+BEGIN_SRC emacs-lisp
(setq mu4e-mu-binary "/usr/local/bin/mu")
#+END_SRC
#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "Open mu4e" "M" #'mu4e)
#+END_SRC
#+BEGIN_SRC emacs-lisp
(after! mu4e
  (setq +mu4e-backend 'offlineimap)
  (setq mu4e-maildir (expand-file-name "~/.Mail/arnav@uber.com"))
  (setq mu4e-attachment-dir (expand-file-name "~/Downloads"))
  (setq mu4e-update-interval (* 5 60))

  (setq mail-user-agent 'mu4e-user-agent)
  (setq mu4e-change-filenames-when-moving nil)
  (setq mu4e-refile-folder "/Archive")
  (setq mu4e-drafts-folder "/[Gmail].Drafts")
  (setq mu4e-sent-folder   "/[Gmail].Sent Mail")
  (setq mu4e-trash-folder  "/[Gmail].Trash")
  (setq mu4e-sent-messages-behavior 'delete)

  (setq mu4e-maildir-shortcuts
        '( ("/INBOX" . ?i)
           ("/[Gmail].Sent Mail"   . ?s)
           ("/1.Phabricator.Diffs"       . ?d)
           ("/[Gmail].Trash"       . ?t)
           ("/1.Phabricator.Tasks"    . ?T)))

  (setq mu4e-get-mail-command "offlineimap")

  (setq
   user-mail-address "arnav@uber.com"
   user-full-name  "Arnav Sharma"
   mu4e-compose-signature "Arnav Sharma\n")
  )
#+end_src

Alert
#+BEGIN_SRC emacs-lisp
(def-package! mu4e-alert
  :after mu4e
  :init
  (setq mu4e-alert-interesting-mail-query
        (concat
         "flag:unread "
         "AND NOT from:umonitor* "
         "AND NOT from:code.uberinternal* "))
        (mu4e-alert-set-default-style 'notifier)
        :config
        (mu4e-alert-enable-mode-line-display)
        (mu4e-alert-enable-notifications))
#+END_SRC

SMTP settings
#+begin_src emacs-lisp
(after! smtpmail
(setq message-send-mail-function 'smtpmail-send-it
        starttls-use-gnutls t
        smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil))
        smtpmail-auth-credentials
          '(("smtp.gmail.com" 587 "arnav@uber.com" nil))
        smtpmail-default-smtp-server "smtp.gmail.com"
        smtpmail-smtp-server "smtp.gmail.com"
        smtpmail-smtp-service 587)
     (setq message-kill-buffer-on-exit t))
#+end_src

[[https://github.com/abo-abo/hydra/wiki/mu4e][abo-abo mu4e hydra]]
#+begin_src emacs-lisp
  (defhydra hydra-mu4e-headers (:color blue :hint nil)
    "
     ^General^   | ^Search^           | _!_: read    | _#_: deferred  | ^Switches^
    -^^----------+-^^-----------------| _?_: unread  | _%_: pattern   |-^^------------------
    _n_: next    | _s_: search        | _r_: refile  | _&_: custom    | _O_: sorting
    _p_: prev    | _S_: edit prev qry | _u_: unmk    | _+_: flag      | _P_: threading
    _]_: n unred | _/_: narrow search | _U_: unmk *  | _-_: unflag    | _Q_: full-search
    _[_: p unred | _b_: search bkmk   | _d_: trash   | _T_: thr       | _V_: skip dups
    _y_: sw view | _B_: edit bkmk     | _D_: delete  | _t_: subthr    | _W_: include-related
    _R_: reply   | _{_: previous qry  | _m_: move    |-^^-------------+-^^------------------
    _C_: compose | _}_: next query    | _a_: action  | _|_: thru shl  | _`_: update, reindex
    _F_: forward | _C-+_: show more   | _A_: mk4actn | _H_: help      | _;_: context-switch
    _o_: org-cap | _C--_: show less   | _*_: *thing  | _q_: quit hdrs | _j_: jump2maildir "

    ;; general
    ("n" mu4e-headers-next)
    ("p" mu4e-headers-previous)
    ("[" mu4e-select-next-unread)
    ("]" mu4e-select-previous-unread)
    ("y" mu4e-select-other-view)
    ("R" mu4e-compose-reply)
    ("C" mu4e-compose-new)
    ("F" mu4e-compose-forward)
    ("o" my/org-capture-mu4e)                  ; differs from built-in

    ;; search
    ("s" mu4e-headers-search)
    ("S" mu4e-headers-search-edit)
    ("/" mu4e-headers-search-narrow)
    ("b" mu4e-headers-search-bookmark)
    ("B" mu4e-headers-search-bookmark-edit)
    ("{" mu4e-headers-query-prev)              ; differs from built-in
    ("}" mu4e-headers-query-next)              ; differs from built-in
    ("C-+" mu4e-headers-split-view-grow)
    ("C--" mu4e-headers-split-view-shrink)
    ("o" arnav/org-capture-mu4e)

    ;; mark stuff
    ("!" mu4e-headers-mark-for-read)
    ("?" mu4e-headers-mark-for-unread)
    ("r" mu4e-headers-mark-for-refile)
    ("u" mu4e-headers-mark-for-unmark)
    ("U" mu4e-mark-unmark-all)
    ("d" mu4e-headers-mark-for-trash)
    ("D" mu4e-headers-mark-for-delete)
    ("m" mu4e-headers-mark-for-move)
    ("a" mu4e-headers-action)                  ; not really a mark per-se
    ("A" mu4e-headers-mark-for-action)         ; differs from built-in
    ("*" mu4e-headers-mark-for-something)

    ("#" mu4e-mark-resolve-deferred-marks)
    ("%" mu4e-headers-mark-pattern)
    ("&" mu4e-headers-mark-custom)
    ("+" mu4e-headers-mark-for-flag)
    ("-" mu4e-headers-mark-for-unflag)
    ("t" mu4e-headers-mark-subthread)
    ("T" mu4e-headers-mark-thread)

    ;; miscellany
    ("q" mu4e~headers-quit-buffer)
    ("H" mu4e-display-manual)
    ("|" mu4e-view-pipe)                       ; does not seem built-in any longer

    ;; switches
    ("O" mu4e-headers-change-sorting)
    ("P" mu4e-headers-toggle-threading)
    ("Q" mu4e-headers-toggle-full-search)
    ("V" mu4e-headers-toggle-skip-duplicates)
    ("W" mu4e-headers-toggle-include-related)

    ;; more miscellany
    ("`" mu4e-update-mail-and-index)           ; differs from built-in
    (";" mu4e-context-switch)
    ("j" mu4e~headers-jump-to-maildir)

    ("." nil))
#+end_src
#+BEGIN_SRC emacs-lisp
;; neeed to define a mode to get this to work
(after! mu4e
  (add-to-list 'mu4e-bookmarks
               (make-mu4e-bookmark
                :name  "Arnav messages"
                :query "date:1d..now and arnav and not to:arnav"
                :key ?a))
  (map! (:map (mu4e-headers-mode-map mu4e-view-mode-map mu4e-compose-mode-map)
          :n "."  #'hydra-mu4e-headers/body
          :n "O" #'arnav/org-capture-mu4e)))
#+END_SRC
#+BEGIN_SRC emacs-lisp
(def-package! org-mu4e
  :after org
  :config
  (setq org-mu4e-link-query-in-headers-mode nil))
#+END_SRC
#+BEGIN_SRC emacs-lisp
(map! :map mu4e-headers-mode-map
      "{"  #'mu4e-headers-query-prev
      "}"  #'mu4e-headers-query-next
      ;; "o"  #'my/org-capture-mu4e

      "A"  #'mu4e-headers-mark-for-action

      "`"  #'mu4e-update-mail-and-index
      "|"  #'mu4e-view-pipe)
#+END_SRC

** Go mode
Golangci linting
#+BEGIN_SRC emacs-lisp
(use-package flycheck-golangci-lint
  :ensure t
  :hook (go-mode . flycheck-golangci-lint-setup))
#+END_SRC
Test stubbing
#+BEGIN_SRC emacs-lisp

(def-package! go-gen-test
  :defer t
  :init
  (map! :mode go-mode
        :localleader
        (:prefix "t"
          (:prefix-map ("g" . "tests generate")
            :desc "Generate missing tests" "g" #'go-gen-test-dwim
            :desc "Generate exported tests" "e" #'go-gen-test-exported
            :desc "Generate missing tests" "a" #'go-gen-test-all))
        )

  )
#+END_SRC

Refactor
#+BEGIN_SRC emacs-lisp

(def-package! go-tag :defer t)
(def-package! godoctor :defer t)
(map! :mode go-mode
      :localleader
      (:prefix-map ("r" . "refactor")
        :desc "add tag" "t"  #'go-tag-add
        :desc "remove tag" "T" #'go-tag-remove
        :desc "add godoc" "d" #'godoctor-godoc
        :desc "extract godoc"  "e" #'godoctor-extract
        :desc "rename"  "r" #'godoctor-rename
        :desc "toggle" "t" #'godoctor-toggle))

#+END_SRC
Keymaps
#+BEGIN_SRC emacs-lisp
(map! :mode go-mode
      :localleader
      (:prefix ("g" . "go to")
      "a" #'ff-find-other-file))

#+END_SRC
Jumping here and there
#+BEGIN_SRC emacs-lisp
(map! :leader
 :mode go-mode
 :after lsp
 :prefix "c"
   :desc "page menu" "M" #'lsp-ui-imenu
   :desc "show doc" "c" #'lsp-describe-thing-at-point
   :desc "restart lsp" "M-r" #'lsp-restart-workspace
   :desc "lsp rename" "R" #'lsp-rename
   :desc "find implementations" "i" #'lsp-find-implementation
   :desc "peek definition" "d" #'lsp-ui-peek-find-definitions
   :desc "peek references" "r" #'lsp-ui-peek-find-references)
#+END_SRC
** Org mode
*** Generic
#+BEGIN_SRC emacs-lisp
(map! :localleader
      :after org
      :map org-mode-map
      "RET" #'org-ctrl-c-ret
      "," #'org-ctrl-c-ctrl-c)
(map! :localleader
      :after org
      :map org-src-mode-map
      :n "," #'org-edit-src-exit
      :n "k" #'org-edit-src-abort
      :n "s" #'org-edit-src-save)
#+END_SRC

Enable autoalist mode
#+BEGIN_SRC emacs-lisp
(def-package! org-autolist
  :hook (org-mode . org-autolist-mode))
#+END_SRC
*** Journaling or trying to

#+BEGIN_SRC emacs-lisp
(def-package! org-journal
:commands (org-journal-new-entry org-journal-search-forever)
;; TODO buffer not opening in journal mode
  :config
  (setq
        org-journal-dir "~/Dropbox/org/journal/"
        org-journal-file-format "%Y-%m-%d"
        org-journal-date-prefix "#+TITLE: "
        org-journal-enable-agenda-integration t
        org-journal-date-format "%A, %B %d %Y"
        org-journal-time-prefix "* "
        org-journal-time-format "")
  (map! :leader
        (:prefix ("o" . "Orggg")
          (:prefix ("j". "Journal")
            :desc "new journal entry" "j" #'org-journal-new-entry
            :desc "new journal entry" "s" #'org-journal-search-forever
            )))
  (map! :map org-journal-mode-map
        :localleader
        "j" #'org-journal-new-entry
        "n" #'org-journal-next-entry
        "p" #'org-journal-previous-entry))
#+END_SRC

*** Secretary
#+BEGIN_SRC emacs-lisp
(def-package! org-secretary
  :config

  (defun my/org-sec-with-view (par &optional who)
    "Select tasks marked as dowith=who, where who
     defaults to the value of org-sec-with."
    (org-tags-view '(4) (join (split-string (if who
                                                who
                                              (org-sec-get-with)))
                              "|" "with=\"" "\"")))
  (defun my/org-sec-who-view (par)
    "Builds agenda for a given user.  Queried. "
    ;; (let ((who (read-string "Build todo for user/tag: "
    ;;                         "" "" "")))
    (let ((who "arnav"))
      (ivy-read "Folks:" org-sec-with-history
                :action (lambda (candidate) (setq who candidate)))
      (my/org-sec-with-view "TODO with" who)
      (org-sec-assigned-with-view "TASK with" who)
      (org-sec-stuck-with-view "STUCK with" who)))

  (defun my/wrapper-get-with (par &optional who)
    "Select tasks marked as dowith=who, where who
     defaults to the value of org-sec-with."
    (org-sec-get-with))
  )
#+END_SRC

*** GTD - or trying to

