config.el

(setq +mu4e-backend 'offlineimap)
(setq mu4e-maildir (expand-file-name "~/.Mail/arnav@uber.com"))
(setq mu4e-attachment-dir (expand-file-name "~/Downloads"))

  (setq mail-user-agent 'mu4e-user-agent)

  (setq mu4e-drafts-folder "/[Gmail].Drafts")
  (setq mu4e-sent-folder   "/[Gmail].Sent Mail")
  (setq mu4e-trash-folder  "/[Gmail].Trash")
  (setq mu4e-sent-messages-behavior 'delete)

  (setq mu4e-maildir-shortcuts
      '( ("/[Gmail].Important" . ?i)
         ("/[Gmail].Sent Mail"   . ?s)
         ("/[Gmail].Trash"       . ?t)
         ("/[Gmail].All Mail"    . ?a)))

  (setq mu4e-get-mail-command "offlineimap")

  (setq
     user-mail-address "arnav@uber.com"
     user-full-name  "Arnav Sharma"
     mu4e-compose-signature "Arnav Sharma\n")

(after! smtpmail
(setq message-send-mail-function 'smtpmail-send-it
        starttls-use-gnutls t
        smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil))
        smtpmail-auth-credentials
          '(("smtp.gmail.com" 587 "arnav@uber.com" nil))
        smtpmail-default-smtp-server "smtp.gmail.com"
        smtpmail-smtp-server "smtp.gmail.com"
        smtpmail-smtp-service 587)
     (setq message-kill-buffer-on-exit t))

(map! :map mu4e-headers-mode-map
      "{"  #'mu4e-headers-query-prev
      "}"  #'mu4e-headers-query-next
      ;; "o"  #'my/org-capture-mu4e

      "A"  #'mu4e-headers-mark-for-action

      "`"  #'mu4e-update-mail-and-index
      "|"  #'mu4e-view-pipe)

(def-package! flycheck-golangci-lint
  :init
  (setq flycheck-golangci-lint-config "~/.golangci.yml")
  :hook (go-mode . flycheck-golangci-lint-setup))

(def-package! go-gen-test
  :defer t
  :init
  (map! :mode go-mode
        :localleader
        (:prefix "t"
          (:prefix-map ("g" . "tests generate")
            :desc "Generate missing tests" "g" #'go-gen-test-dwim
            :desc "Generate exported tests" "e" #'go-gen-test-exported
            :desc "Generate missing tests" "a" #'go-gen-test-all))
        )

  )

(def-package! go-tag :defer t)
(def-package! godoctor :defer t)
(map! :mode go-mode
      :localleader
      (:prefix-map ("r" . "refactor")
        :desc "add tag" "t"  #'go-tag-add
        :desc "remove tag" "T" #'go-tag-remove
        :desc "add godoc" "d" #'godoctor-godoc
        :desc "extract godoc"  "e" #'godoctor-extract
        :desc "rename"  "r" #'godoctor-rename
        :desc "toggle" "t" #'godoctor-toggle))

(map! :mode go-mode
      :localleader
      (:prefix ("g" . "go to")
      "ga" #'ff-find-other-file))

(map! :leader
 :mode go-mode
 :after lsp
 :prefix "c"
   :desc "page menu" "M" #'lsp-ui-imenu
   :desc "show doc" "c" #'lsp-describe-thing-at-point
   :desc "restart lsp" "R" #'lsp-restart-workspace
   :desc "lsp rename" "r" #'lsp-rename
   :desc "find implementations" "i" #'lsp-find-implementation
   :desc "peek definition" "d" #'lsp-ui-peek-find-definitions
   :desc "peek references" "D" #'lsp-ui-peek-find-references)

(map! :localleader
      :after org
      :map org-mode-map
      "RET" #'org-ctrl-c-ret
      "," #'org-ctrl-c-ctrl-c)
(map! :localleader
      :after org
      :map org-src-mode-map
      :n "," #'org-edit-src-exit
      :n "k" #'org-edit-src-abort
      :n "s" #'org-edit-src-save)

(def-package! org-journal
:commands (org-journal-new-entry org-journal-search-forever)
;; TODO buffer not opening in journal mode
  :config
  (setq
        org-journal-dir "~/Dropbox/org/journal/"
        org-journal-file-format "%Y-%m-%d.org"
        org-journal-date-prefix "#+TITLE: "
        org-journal-date-format "%A, %B %d %Y"
        org-journal-time-prefix "* "
        org-journal-time-format "")
  (map! :leader
        (:prefix ("o" . "Orggg")
          (:prefix ("j". "Journal")
            :desc "new journal entry" "j" #'org-journal-new-entry
            :desc "new journal entry" "s" #'org-journal-search-forever
            )))
  (map! :map org-journal-mode-map
        :localleader
        "j" #'org-journal-new-entry
        "n" #'org-journal-next-entry
        "p" #'org-journal-previous-entry))

(def-package! org-secretary
  :config

  (defun my/org-sec-with-view (par &optional who)
    "Select tasks marked as dowith=who, where who
     defaults to the value of org-sec-with."
    (org-tags-view '(4) (join (split-string (if who
                                                who
                                              (org-sec-get-with)))
                              "|" "with=\"" "\"")))
  (defun my/org-sec-who-view (par)
    "Builds agenda for a given user.  Queried. "
    ;; (let ((who (read-string "Build todo for user/tag: "
    ;;                         "" "" "")))
    (let ((who "arnav"))
      (ivy-read "Folks:" org-sec-with-history
                :action (lambda (candidate) (setq who candidate)))
      (my/org-sec-with-view "TODO with" who)
      (org-sec-assigned-with-view "TASK with" who)
      (org-sec-stuck-with-view "STUCK with" who)))

  (defun my/wrapper-get-with (par &optional who)
    "Select tasks marked as dowith=who, where who
     defaults to the value of org-sec-with."
    (org-sec-get-with))
  )

(after! org
