config.el
  (setq org-todo-keywords
        '((sequence "TODO(t)" "INPROGRESS(p/!)" "WAIT(w@/!)" "|" "DONE(d/!)" "CANCELLED(c@/!)")
          (sequence "TASK(f)" "|" "CANCELLED(c)" "DONE(D)")))
  (setq org-log-states-order-reversed t)

  
)

(setq arnav/inbox-file "~/Dropbox/org/gtd/inbox.org")
(setq arnav/gtd-file "~/Dropbox/org/gtd/gtd.org")
(setq arnav/notes-file "~/Dropbox/org/notes.org")
(setq arnav/someday-file "~/Dropbox/org/gtd/someday.org")
(setq arnav/tickler-file "~/Dropbox/org/gtd/tickler.org")
(setq arnav/uber-calendar-file "~/Dropbox/org/calendar/arnav@uber.org")
(map! :leader
      "x" nil
      (:prefix "x"
        (:prefix ("g". "goto")
          :desc "open inbox file" "i" (λ! (find-file arnav/inbox-file) )
          :desc "open gtd file" "g" (λ! (find-file arnav/gtd-file) )
          :desc "open notes file" "n" (λ! (find-file arnav/notes-file) )
          :desc "open someday file" "s" (λ! (find-file arnav/someday-file) )
          :desc "open tickler file" "T" (λ! (find-file arnav/tickler-file) )
          )
        "x" #'org-agenda-list
        "c" #'org-capture
        "a" #'org-agenda))

(setq org-refile-targets '((arnav/gtd-file :maxlevel . 1)
                           (arnav/someday-file :level . 1)
                           (arnav/tickler-file :maxlevel . 2)))
(setq org-refile-use-outline-path t
      org-outline-path-complete-in-steps nil)
(setq org-refile-allow-creating-parent-nodes 'confirm)

(setq org-agenda-files (list arnav/inbox-file
                         arnav/gtd-file
                         arnav/uber-calendar-file
                         arnav/tickler-file))

(after! org
        (setq org-capture-templates '(("t" "Todo [inbox]" entry
                                       (file+headline "~/Dropbox/org/gtd/inbox.org" "Tasks")
                                       (file "~/Dropbox/org/templates/todo.orgcaptmpl")
                                       :empty-lines 1)
                                      ("f" "Task [inbox]" entry
                                       (file+headline "~/Dropbox/org/gtd/inbox.org" "Tasks")
                                       (file "~/Dropbox/org/templates/task.orgcaptmpl")
                                       :empty-lines 1)
                                      ("a" "Appointment" entry
                                       (file  "~/Dropbox/org/calendar/arnav@uber.org" )
                                       "* %?\n\n%^T\n\n:PROPERTIES:\n\n:END:\n\n")
                                      ("T" "Tickler" entry
                                       (file+headline "~/Dropbox/org/gtd/tickler.org" "Tickler")
                                       "* %i%? \n %U" :empty-lines 1)
                                      ("i" "Interview"
                                       entry
                                       (file "~/Dropbox/org/interviews.org")
                                       (file "~/Dropbox/org/templates/interview.orgcaptmpl"))
                                      ("n" "Note" entry
                                       (file+headline "~/Dropbox/org/notes.org" "Notes")
                                       "* %i%? %^g\nLogged on %U" :empty-lines 1)
                                      ))
        (map! :map org-capture-mode-map
              :localleader
              "," #'org-capture-finalize
              "k" #'org-capture-kill))

(after! org
  ;; Hydra for org agenda (graciously taken from Spacemacs)
  (defhydra hydra-org-agenda (:pre (setq which-key-inhibit t)
                                   :post (setq which-key-inhibit nil)
                                   :hint none)
    "
Org agenda (_q_uit)

^Clock^      ^Visit entry^              ^Date^             ^Other^
^-----^----  ^-----------^------------  ^----^-----------  ^-----^---------
_ci_ in      _SPC_ in other window      _ds_ schedule      _gr_ reload
_co_ out     _TAB_ & go to location     _dd_ set deadline  _._  go to today
_cq_ cancel  _RET_ & del other windows  _dt_ timestamp     _gd_ go to date
_cj_ jump    _o_   link                 _+_  do later      ^^
^^           ^^                         _-_  do earlier    ^^
^^           ^^                         ^^                 ^^
^View^          ^Filter^                 ^Headline^         ^Toggle mode^
^----^--------  ^------^---------------  ^--------^-------  ^-----------^----
_vd_ day        _ft_ by tag              _ht_ set status    _tf_ follow
_vw_ week       _fr_ refine by tag       _hk_ kill          _tl_ log
_vt_ fortnight  _fc_ by category         _hr_ refile        _ta_ archive trees
_vm_ month      _fh_ by top headline     _hA_ archive       _tA_ archive files
_vy_ year       _fx_ by regexp           _h:_ set tags      _tr_ clock report
_vn_ next span  _fd_ delete all filters  _hp_ set priority  _td_ diaries
_vp_ prev span  ^^                       ^^                 ^^
_vr_ reset      ^^                       ^^                 ^^
^^              ^^                       ^^                 ^^
"
    ;; Entry
    ("hA" org-agenda-archive-default)
    ("hk" org-agenda-kill)
    ("hp" org-agenda-priority)
    ("hr" org-agenda-refile)
    ("h:" org-agenda-set-tags)
    ("ht" org-agenda-todo)
    ;; Visit entry
    ("o"   link-hint-open-link :exit t)
    ("<tab>" org-agenda-goto :exit t)
    ("TAB" org-agenda-goto :exit t)
    ("SPC" org-agenda-show-and-scroll-up)
    ("RET" org-agenda-switch-to :exit t)
    ;; Date
    ("dt" org-agenda-date-prompt)
    ("dd" org-agenda-deadline)
    ("+" org-agenda-do-date-later)
    ("-" org-agenda-do-date-earlier)
    ("ds" org-agenda-schedule)
    ;; View
    ("vd" org-agenda-day-view)
    ("vw" org-agenda-week-view)
    ("vt" org-agenda-fortnight-view)
    ("vm" org-agenda-month-view)
    ("vy" org-agenda-year-view)
    ("vn" org-agenda-later)
    ("vp" org-agenda-earlier)
    ("vr" org-agenda-reset-view)
    ;; Toggle mode
    ("ta" org-agenda-archives-mode)
    ("tA" (org-agenda-archives-mode 'files))
    ("tr" org-agenda-clockreport-mode)
    ("tf" org-agenda-follow-mode)
    ("tl" org-agenda-log-mode)
    ("td" org-agenda-toggle-diary)
    ;; Filter
    ("fc" org-agenda-filter-by-category)
    ("fx" org-agenda-filter-by-regexp)
    ("ft" org-agenda-filter-by-tag)
    ("fr" org-agenda-filter-by-tag-refine)
    ("fh" org-agenda-filter-by-top-headline)
    ("fd" org-agenda-filter-remove-all)
    ;; Clock
    ("cq" org-agenda-clock-cancel)
    ("cj" org-agenda-clock-goto :exit t)
    ("ci" org-agenda-clock-in :exit t)
    ("co" org-agenda-clock-out)
    ;; Other
    ("q" nil :exit t)
    ("gd" org-agenda-goto-date)
    ("." org-agenda-goto-today)
    ("gr" org-agenda-redo))

  (map! :map org-agenda-mode-map
        :localleader
        "." #'hydra-org-agenda/body))
