config.el

(def-package! org-super-agenda
  :after org-agenda
  :init
  (setq org-agenda-span 'day)
  (setq org-agenda-start-day nil)

  (setq org-super-agenda-groups
        '(;; Each group has an implicit boolean OR operator between its selectors.
          (:name "Important"
                 :priority>= "B"
                 ;; Show this section after "Today" and "Important", because
                 ;; their order is unspecified, defaulting to 0. Sections
                 ;; are displayed lowest-number-first.
                 :order 0)
          (:name "Today"  ; Optionally specify section name
                 :todo ("INPROGRESS" "TODO")
                 :order 1)  ; Items that have this TODO keyword
          ;; Set order of multiple groups at once
          (:order-multi (2 (:name "Waiting"
                                  :todo "WAIT"
                                  )
                           (:name "Done"
                                  :todo ("DONE"))))
          (:auto-property "with")
          (:name "Lead tasks"
                 ;; Single arguments given alone
                 :todo "TASK"
                 )
          (:discard
           (:regexp ("gym" "deployment" "yoga" "office hours")))
          (:name "Calendar"
                 :time-grid t
                 :order 5
                 )
          ;; After the last group, the agenda will display items that didn't
          ;; match any of these groups, with the default order position of 99
          ))
  :config
  (org-super-agenda-mode)
  )

(after! org-agenda
  (setq org-agenda-custom-commands
        '(("h" "Work todos" tags-todo
           "-personal-doat={.+}-dowith={.+}/!-TASK"
           ((org-agenda-todo-ignore-scheduled t)))
          ("u" "Unscheduled TODO"
           ((todo ""
                  ((org-agenda-overriding-header "\nUnscheduled TODO")
                   (org-agenda-skip-function '(org-agenda-skip-entry-if 'scheduled 'deadline))))) nil)
          ("H" "All work todos" tags-todo "-personal/!-TASK"
           ((org-agenda-todo-ignore-scheduled nil)))
          ("A" "Work todos with doat or dowith" tags-todo
           "-personal+doat={.+}|dowith={.+}/!-TASK"
           ((org-agenda-todo-ignore-scheduled nil)))
          ("j" "Interactive TODO dowith and TASK with"
           ((my/org-sec-who-view "TODO dowith")))
          )))

(after! org-gcal

  (setq org-gcal-client-id "609584643994-unjps7piimpal1v8fq14n61ru410vc7f.apps.googleusercontent.com"
        org-gcal-client-secret "djhZ6XBKwe67H8syu9Q24gEU"
        org-gcal-file-alist '(("arnav@uber.com" .  "/Users/arnav/Dropbox/org/calendar/arnav@uber.org")))
  (setq org-gcal-auto-archive t)
  (setq org-gcal-down-days 30)
  (setq org-gcal-up-days 30)
  (run-with-timer 0 (* 10 60) 'org-gcal-sync)
  )

(after! org
   ;; Resume clocking task when emacs is restarted
   (org-clock-persistence-insinuate)
   ;; Save the running clock and all clock history when exiting Emacs, load it on startup
   (setq org-clock-persist t)
   ;; Resume clocking task on clock-in if the clock is open
   (setq org-clock-in-resume t)
   ;; Do not prompt to resume an active clock, just resume it
   (setq org-clock-persist-query-resume nil)

   ;; Change tasks to whatever when clocking out
   (setq org-clock-out-switch-to-state "DONE")
   ;; Change tasks to whatever when clocking in
   (setq org-clock-in-switch-to-state "INPROGRESS")
   ;; Save clock data and state changes and notes in the LOGBOOK drawer
   (setq org-clock-into-drawer t)
   ;; Sometimes I change tasks I'm clocking quickly - this removes clocked tasks
   ;; with 0:00 duration
   (setq org-clock-out-remove-zero-time-clocks t)
   ;; Clock out when moving task to a done state
   (setq org-clock-out-when-done t)
   ;; Enable auto clock resolution for finding open clocks
   ;; commenting out as I don't know what this does
   ;; (setq org-clock-auto-clock-resolution (quote when-no-clock-is-running))
   ;; Include current clocking task in clock reports
   (setq org-clock-report-include-clocking-task t)
   ;; use pretty things for the clocktable
   (setq org-pretty-entities t)
  )

(after! org
  (add-to-list 'org-latex-packages-alist '("" "minted"))

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((R . t)
     (shell . t)
     (go . t)
     (plantuml . t)
     (latex . t)))
  (setq org-plantuml-jar-path
        (expand-file-name "/usr/local/Cellar/plantuml/1.2019.5/libexec/plantuml.jar"))


  )

  (alert "Successfully loaded: booyeah" :title "Doomed")
